Обработки/Reports/_ОтчетОДеятельностиПоУправлениюЦеннымиБумагами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОтчетОДеятельностиПоУправлениюЦеннымиБумагами</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>mxl:SpreadsheetDocument</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОтчетОДеятельностиПоУправлениюЦеннымиБумагами/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт	
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Отчет о деятельности по управлению ценными бумагами",
		"0.10",
		"",
		Истина
	);
		
	// команды отсутствуют - только интерактивный запуск
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ВыполнитьПроверкуНаНаличиеУКлиентНедопустимыхСделок()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("Клиент",			Клиент);
	Запрос.УстановитьПараметр("НачалоПериода",	Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода",	Период.ДатаОкончания);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	СделкаРЕПО.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ _СделкиРЕПО
		|ИЗ
		|	Документ.СделкаРЕПО КАК СделкаРЕПО
		|ГДЕ
		|	СделкаРЕПО.Организация = &Организация
		|	И СделкаРЕПО.СчетДоверительногоУправления = &Клиент
		|	И СделкаРЕПО.Проведен
		|	И СделкаРЕПО.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Сделка.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ _СделкиПоНеподдерживаемымРынкам
		|ИЗ
		|	Документ.Сделка КАК Сделка
		|ГДЕ
		|	Сделка.Организация = &Организация
		|	И Сделка.СчетДоверительногоУправления = &Клиент
		|	И Сделка.Проведен
		|	И Сделка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ Сделка.Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК Клиент,
		|	НЕ _СделкиПоНеподдерживаемымРынкам.Ссылка ЕСТЬ NULL КАК НеподдерживаемыеРынки,
		|	НЕ _СделкиРЕПО.Ссылка ЕСТЬ NULL КАК СделкиРЕПО
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СделкиРЕПО КАК _СделкиРЕПО
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СделкиПоНеподдерживаемымРынкам КАК _СделкиПоНеподдерживаемымРынкам
		|		ПО (ИСТИНА)
		|ГДЕ
		|	СчетаДоверительногоУправления.Ссылка = &Клиент";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если Выборка.НеподдерживаемыеРынки Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У клиента " + Выборка.Клиент + " в отчетном периоде обнаружено наличие сделок по рынкам ценных бумаг, отличных от Акций и Облигаций. Данный отчет не поддерживает сделки по таким рынкам.");
		КонецЕсли;
		
		Если Выборка.СделкиРЕПО Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У клиента " + Выборка.Клиент + " обнаружено наличие сделок РЕПО в отчетном периоде. Данный отчет не поддерживает этот вид сделок");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьВариантыДДСДляОтбораДоходов()
	
	ВариантыДДС = Новый Массив;
	
	ВариантыДДС.Добавить(Справочники.ВидыЗадолженности.ПоВозвратуКупонногоДохода);
	ВариантыДДС.Добавить(Справочники.ВидыЗадолженности.ПоДепозитномуВкладуПроценты);
	ВариантыДДС.Добавить(Справочники.ВидыЗадолженности.ПоНачислениюДивидендовАкции);
	ВариантыДДС.Добавить(Справочники.ВидыЗадолженности.ПоНачислениюДивидендовДепозитарныеРасписки);
	ВариантыДДС.Добавить(Справочники.ВидыЗадолженности.ПоНачислениюДивидендовИпотечныеСертификатыУчастия);
	ВариантыДДС.Добавить(Справочники.ВидыЗадолженности.ПоНачислениюДивидендовПаи);
	ВариантыДДС.Добавить(Справочники.ВидыЗадолженности.ПоНачислениюРаспределяемойПрибылиООО);
	ВариантыДДС.Добавить(Справочники.ВидыЗадолженности.ПоПогашениюКупона);
	ВариантыДДС.Добавить(Справочники.ВидыЗадолженности.ПоПоследнемуПогашениюКупона);
	ВариантыДДС.Добавить(Справочники.ВидыЗадолженности.РасчетыСПайщикамиПоВыплатеДоходаПоИнвестиционнымПаям);
	
	Возврат ВариантыДДС;
	
КонецФункции

Процедура СформироватьОтчет() Экспорт
	
	// Фиксируем старт операции
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,Клиент");	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".СформироватьОтчет()";
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	// Проверка и формирование		
	ВыполнитьПроверкуНаНаличиеУКлиентНедопустимыхСделок();
	
	Результат.Очистить();
	
	Макет = ПолучитьМакет("Макет");
	
	Шапка									= Макет.ПолучитьОбласть("Шапка");
	СтрокаОперацииСДС						= Макет.ПолучитьОбласть("СтрокаОперацииСДС");
	ЗаголовокДвивидены						= Макет.ПолучитьОбласть("ЗаголовокДвивидены");
	СтрокаДивиденды							= Макет.ПолучитьОбласть("СтрокаДивиденды");
	ЗаголовокСделки							= Макет.ПолучитьОбласть("ЗаголовокСделки");
	ЗаголовокЭмитент						= Макет.ПолучитьОбласть("ЗаголовокЭмитент");
	ЗаголовокТипАктива						= Макет.ПолучитьОбласть("ЗаголовокТипАктива");
	СтрокаСделки							= Макет.ПолучитьОбласть("СтрокаСделки");
	ЗаголовокОперацииСовершенныеРанее		= Макет.ПолучитьОбласть("ЗаголовокОперацииСовершенныеРанее");
	СтрокаОперацииСовершенныеРанее			= Макет.ПолучитьОбласть("СтрокаОперацииСовершенныеРанее");
	ЗаголовокСведенияОКредитныхОрганизациях	= Макет.ПолучитьОбласть("ЗаголовокСведенияОКредитныхОрганизациях");
	СтрокаСведенияОКредитныхОрганизациях	= Макет.ПолучитьОбласть("СтрокаСведенияОКредитныхОрганизациях");
	ЗаголовокСведенияОБрокере				= Макет.ПолучитьОбласть("ЗаголовокСведенияОБрокере");
	СтрокаСведенияОБрокере					= Макет.ПолучитьОбласть("СтрокаСведенияОБрокере");
	ЗаголовокСведенияОДепозитариях			= Макет.ПолучитьОбласть("ЗаголовокСведенияОДепозитариях");
	СтрокаСведенияОДепозитариях				= Макет.ПолучитьОбласть("СтрокаСведенияОДепозитариях");
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ГраницаНачалоПериода",					Новый Граница(Период.ДатаНачала, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ГраницаКонецПериода",					Новый Граница(Период.ДатаОкончания, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("НачалоПериода",							Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода",							Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Клиент",									Клиент);
	Запрос.УстановитьПараметр("Организация",							Организация);
	Запрос.УстановитьПараметр("ОперацииДДС",							ПолучитьОперацииДДС());
	Запрос.УстановитьПараметр("Рубль",									Организация.ВалютаУчета);
	Запрос.УстановитьПараметр("ВидыЗадолженностиДляТаблицыДивидендов",	ПолучитьВариантыДДСДляОтбораДоходов());
	
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(ОперацииДДС.Вид КАК Перечисление.ВидыДвиженийДенежныхСредств) КАК Вид,
		|	ОперацииДДС.Вариант КАК Вариант,
		|	ВЫРАЗИТЬ(ОперацииДДС.Операция КАК СТРОКА) КАК Операция
		|ПОМЕСТИТЬ _ОперацииДДС
		|ИЗ
		|	&ОперацииДДС КАК ОперацииДДС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключения,
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
		|ПОМЕСТИТЬ _ДанныеДоговора
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&КонецПериода, СчетДоверительногоУправления = &Клиент) КАК КлиентыДоверительногоУправленияСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Сделка.Ссылка КАК Сделка
		|ПОМЕСТИТЬ _СписокСделок
		|ИЗ
		|	Документ.Сделка КАК Сделка
		|ГДЕ
		|	Сделка.Организация = &Организация
		|	И Сделка.СчетДоверительногоУправления = &Клиент
		|	И Сделка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Сделка.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СделкаЦенныеБумаги.Ссылка КАК Сделка,
		|	СделкаЦенныеБумаги.Ссылка.Дата КАК ДатаСделки,
		|	СделкаЦенныеБумаги.Ссылка.ВидСделки КАК ВидСделки,
		|	СделкаЦенныеБумаги.Ссылка.Рынок КАК Рынок,
		|	СделкаЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА СделкаЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|		КОГДА СделкаЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Акции).Эмитент.ЮрФизЛицо
		|		КОГДА СделкаЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|			ТОГДА РеквизитыПИФСрезПоследних.УправляющаяКомпания.ЮрФизЛицо
		|		КОГДА СделкаЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ДепозитарныеРасписки)
		|			ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).Эмитент.ЮрФизЛицо
		|		КОГДА СделкаЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия)
		|			ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент.ЮрФизЛицо
		|		КОГДА СделкаЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Векселя)
		|			ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Векселя).Эмитент.ЮрФизЛицо
		|	КОНЕЦ КАК Эмитент,
		|	ВЫБОР
		|		КОГДА СделкаЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫБОР
		|					КОГДА СделкаЦенныеБумаги.ЦеннаяБумага.Подкатегория <> ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхОблигаций.ПустаяСсылка)
		|						ТОГДА СделкаЦенныеБумаги.ЦеннаяБумага.Подкатегория
		|					ИНАЧЕ ""Облигация""
		|				КОНЕЦ
		|		КОГДА СделкаЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА ""Акция""
		|		КОГДА СделкаЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|			ТОГДА ""Пай""
		|		КОГДА СделкаЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ДепозитарныеРасписки)
		|			ТОГДА ""Депозитарная расписка""
		|		КОГДА СделкаЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия)
		|			ТОГДА ""Ипотечный сертификат участия""
		|		КОГДА СделкаЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Векселя)
		|			ТОГДА ""Вексель""
		|	КОНЕЦ КАК ТипЦБ,
		|	ВЫБОР
		|		КОГДА СделкаЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА СделкаЦенныеБумаги.ЦеннаяБумага.ГосударственныйРегистрационныйНомер
		|		КОГДА СделкаЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА СделкаЦенныеБумаги.ЦеннаяБумага.ГосударственныйРегистрационныйНомер
		|		КОГДА СделкаЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
		|			ТОГДА СделкаЦенныеБумаги.ЦеннаяБумага.ГосударственныйРегистрационныйНомер
		|		КОГДА СделкаЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ДепозитарныеРасписки)
		|			ТОГДА СделкаЦенныеБумаги.ЦеннаяБумага.РегистрационныйНомер
		|		КОГДА СделкаЦенныеБумаги.Ссылка.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия)
		|			ТОГДА СделкаЦенныеБумаги.ЦеннаяБумага.ГосударственныйРегистрационныйНомер
		|	КОНЕЦ КАК ГосударственныйРегистрационныйНомер,
		|	УсловияСделокСрезПоследних.ДатаПоставки КАК ДатаПоставки,
		|	УсловияСделокСрезПоследних.ДатаОплаты КАК ДатаОплаты,
		|	УсловияСделокСрезПоследних.Количество КАК Количество,
		|	УсловияСделокСрезПоследних.Цена КАК Цена,
		|	УсловияСделокСрезПоследних.Сумма КАК Сумма,
		|	УсловияСделокСрезПоследних.СуммаКупона КАК СуммаКупона,
		|	СделкаЦенныеБумаги.Ссылка.ВалютаСделки <> &Рубль КАК ВыводитьКурс,
		|	СделкаЦенныеБумаги.Ссылка.ВалютаСделки КАК ВалютаСделки,
		|	УсловияСделокСрезПоследних.СобственныйКурсОплаты КАК СобственныйКурсОплаты,
		|	УсловияСделокСрезПоследних.КурсОплаты КАК КурсОплаты,
		|	ВЫБОР
		|		КОГДА СделкаЦенныеБумаги.Ссылка.МестоХранения В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок))
		|			ТОГДА ""Внебиржевой рынок""
		|		ИНАЧЕ СделкаЦенныеБумаги.Ссылка.МестоХранения.Биржа
		|	КОНЕЦ КАК Биржа,
		|	УсловияСделокСрезПоследних.ОтложенноеИсполнение КАК ОтложенноеИсполнение,
		|	ВЫБОР
		|		КОГДА СделкаЦенныеБумаги.Ссылка.Контрагент = ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)
		|				И НЕ СделкаЦенныеБумаги.Ссылка.МестоХранения В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок))
		|			ТОГДА СделкаЦенныеБумаги.Ссылка.МестоХранения.Биржа.ЮрФизЛицо
		|		ИНАЧЕ СделкаЦенныеБумаги.Ссылка.Контрагент
		|	КОНЕЦ КАК Контрагент
		|ПОМЕСТИТЬ _Сделки
		|ИЗ
		|	Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделок.СрезПоследних(&КонецПериода, Организация = &Организация) КАК УсловияСделокСрезПоследних
		|		ПО СделкаЦенныеБумаги.Ссылка = УсловияСделокСрезПоследних.Сделка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&КонецПериода, ) КАК РеквизитыПИФСрезПоследних
		|		ПО СделкаЦенныеБумаги.ЦеннаяБумага.ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд
		|ГДЕ
		|	СделкаЦенныеБумаги.Ссылка В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				_СписокСделок.Сделка КАК Сделка
		|			ИЗ
		|				_СписокСделок КАК _СписокСделок)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КурсыВалют.Период КАК Период,
		|	КурсыВалют.Валюта КАК Валюта,
		|	КурсыВалют.Курс КАК Курс,
		|	КурсыВалют.Кратность КАК Кратность
		|ПОМЕСТИТЬ _КурсыВалютДляСделок
		|ИЗ
		|	РегистрСведений.КурсыВалют КАК КурсыВалют
		|ГДЕ
		|	(КурсыВалют.Период, КурсыВалют.Валюта) В
		|			(ВЫБРАТЬ
		|				_Сделки.ДатаОплаты КАК Период,
		|				_Сделки.ВалютаСделки КАК Валюта
		|			ИЗ
		|				_Сделки КАК _Сделки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РасходыПоСделкеОбороты.Сделка КАК Сделка,
		|	РасходыПоСделкеОбороты.ВидЗадолженности КАК ВидЗадолженности,
		|	СУММА(РасходыПоСделкеОбороты.СуммаОборот) КАК Сумма
		|ПОМЕСТИТЬ _РасходыПоСделкам
		|ИЗ
		|	РегистрНакопления.РасходыПоСделке.Обороты(
		|			&ГраницаНачалоПериода,
		|			&ГраницаКонецПериода,
		|			Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &Клиент
		|				И ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии))
		|				И Сделка В
		|					(ВЫБРАТЬ
		|						_Сделки.Сделка КАК Сделка
		|					ИЗ
		|						_Сделки КАК _Сделки)) КАК РасходыПоСделкеОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходыПоСделкеОбороты.Сделка,
		|	РасходыПоСделкеОбороты.ВидЗадолженности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу КАК Эмитент,
		|	_Сделки.ТипЦБ КАК ТипЦБ,
		|	_Сделки.ЦеннаяБумага КАК Актив,
		|	_Сделки.ГосударственныйРегистрационныйНомер КАК ГосударственныйРегистрационныйНомер,
		|	КодыВТорговыхСистемахСрезПоследних.Код КАК ISIN,
		|	ВЫБОР
		|		КОГДА _Сделки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА НоминалыЦенныхБумагСрезПоследних.Номинал
		|		КОГДА _Сделки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|			ТОГДА _Сделки.ЦеннаяБумага.Номинал
		|		КОГДА _Сделки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Векселя)
		|			ТОГДА _Сделки.ЦеннаяБумага.Номинал
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Номинал,
		|	_Сделки.ДатаСделки КАК Дата,
		|	_Сделки.ДатаПоставки КАК ДатаПоставки,
		|	_Сделки.ДатаОплаты КАК ДатаОплаты,
		|	_Сделки.ВидСделки КАК Операция,
		|	_Сделки.Количество КАК Количество,
		|	_Сделки.Цена КАК Цена,
		|	_Сделки.Сумма КАК Сумма,
		|	ВЫБОР
		|		КОГДА _Сделки.ВыводитьКурс
		|			ТОГДА ВЫБОР
		|					КОГДА _Сделки.СобственныйКурсОплаты
		|						ТОГДА _Сделки.КурсОплаты
		|					ИНАЧЕ _КурсыВалютДляСделок.Курс / _КурсыВалютДляСделок.Кратность
		|				КОНЕЦ
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Курс,
		|	_Сделки.СуммаКупона КАК НКД,
		|	_РасходыПоСделкамБрокерскаяКомиссия.Сумма КАК КомиссияБрокера,
		|	_РасходыПоСделкамТорговаяКомиссия.Сумма КАК БиржевойСбор,
		|	_Сделки.Биржа КАК Биржа,
		|	_Сделки.Сделка КАК Сделка,
		|	_Сделки.Контрагент КАК Контрагент
		|ПОМЕСТИТЬ _ДанныеПоСделкам
		|ИЗ
		|	_Сделки КАК _Сделки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&КонецПериода,
		|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И ЮрФизЛицо В
		|						(ВЫБРАТЬ
		|							_Сделки.Эмитент КАК Эмитент
		|						ИЗ
		|							_Сделки КАК _Сделки)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО _Сделки.Эмитент = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(
		|				&КонецПериода,
		|				ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)
		|					И Объект В
		|						(ВЫБРАТЬ
		|							_Сделки.ЦеннаяБумага КАК ЦеннаяБумага
		|						ИЗ
		|							_Сделки КАК _Сделки)) КАК КодыВТорговыхСистемахСрезПоследних
		|		ПО _Сделки.ЦеннаяБумага = КодыВТорговыхСистемахСрезПоследних.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РасходыПоСделкам КАК _РасходыПоСделкамБрокерскаяКомиссия
		|		ПО _Сделки.Сделка = _РасходыПоСделкамБрокерскаяКомиссия.Сделка
		|			И (_РасходыПоСделкамБрокерскаяКомиссия.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РасходыПоСделкам КАК _РасходыПоСделкамТорговаяКомиссия
		|		ПО _Сделки.Сделка = _РасходыПоСделкамТорговаяКомиссия.Сделка
		|			И (_РасходыПоСделкамТорговаяКомиссия.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг.СрезПоследних(
		|				&КонецПериода,
		|				ЦеннаяБумага В
		|					(ВЫБРАТЬ
		|						_Сделки.ЦеннаяБумага КАК ЦеннаяБумага
		|					ИЗ
		|						_Сделки КАК _Сделки
		|					ГДЕ
		|						_Сделки.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации))) КАК НоминалыЦенныхБумагСрезПоследних
		|		ПО _Сделки.ЦеннаяБумага = НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КурсыВалютДляСделок КАК _КурсыВалютДляСделок
		|		ПО _Сделки.ДатаОплаты = _КурсыВалютДляСделок.Период
		|			И _Сделки.ВалютаСделки = _КурсыВалютДляСделок.Валюта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет КАК РасчетныйСчет,
		|	ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.Банк.ЮрФизЛицо КАК Банк,
		|	ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.Валюта КАК Валюта,
		|	ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.НомерСчета КАК НомерСчета
		|ПОМЕСТИТЬ _БанковскиеСчета
		|ИЗ
		|	РегистрСведений.ИсполнителиПоДенежнымСредствамСобственные КАК ИсполнителиПоДенежнымСредствамСобственные
		|ГДЕ
		|	ИсполнителиПоДенежнымСредствамСобственные.Организация = &Организация
		|	И ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления = &Клиент
		|	И (ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия > &КонецПериода)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_БанковскиеСчета.РасчетныйСчет КАК РасчетныйСчет,
		|	РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу КАК Банк,
		|	_БанковскиеСчета.Валюта КАК Валюта,
		|	_БанковскиеСчета.НомерСчета КАК НомерСчета
		|ПОМЕСТИТЬ _ДанныеБанковскихСчетов
		|ИЗ
		|	_БанковскиеСчета КАК _БанковскиеСчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&КонецПериода,
		|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И ЮрФизЛицо В
		|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|							_БанковскиеСчета.Банк КАК Банк
		|						ИЗ
		|							_БанковскиеСчета КАК _БанковскиеСчета)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО _БанковскиеСчета.Банк = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КурсыВалют.Период КАК Период,
		|	КурсыВалют.Валюта КАК Валюта,
		|	КурсыВалют.Курс КАК Курс,
		|	КурсыВалют.Кратность КАК Кратность
		|ПОМЕСТИТЬ _КурсыВалютДляДвиженийДС
		|ИЗ
		|	РегистрСведений.КурсыВалют КАК КурсыВалют
		|ГДЕ
		|	КурсыВалют.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И КурсыВалют.Валюта В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				_ДанныеБанковскихСчетов.Валюта КАК Валюта
		|			ИЗ
		|				_ДанныеБанковскихСчетов КАК _ДанныеБанковскихСчетов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоДенежнымСредствамОбороты.Регистратор КАК Регистратор,
		|	МИНИМУМ(НАЧАЛОПЕРИОДА(ЗадолженностиПоДенежнымСредствамОбороты.Основание.Дата, ДЕНЬ)) КАК ДатаНачисления
		|ПОМЕСТИТЬ _ДатыНачисленияЗадолженности
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(, &ГраницаКонецПериода, Регистратор, ВидЗадолженности В (&ВидыЗадолженностиДляТаблицыДивидендов)) КАК ЗадолженностиПоДенежнымСредствамОбороты
		|ГДЕ
		|	ЗадолженностиПоДенежнымСредствамОбороты.СуммаКупонаРасход <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗадолженностиПоДенежнымСредствамОбороты.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.Основание КАК Документ.Сделка) КАК Сделка,
		|	СУММА(ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.КоличествоКонечныйОстаток) КАК ОстатокЗадолженностиПоЦБ
		|ПОМЕСТИТЬ _ОстаткиЗадолженностиПоЦБПоИсполненнымСделкам
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоЦеннымБумагам.ОстаткиИОбороты(
		|			&ГраницаНачалоПериода,
		|			&ГраницаКонецПериода,
		|			Период,
		|			ДвиженияИГраницыПериода,
		|			ТИПЗНАЧЕНИЯ(Основание) = ТИП(Документ.Сделка)
		|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
		|				И Организация = &Организация
		|				И СчетДоверительногоУправления = &Клиент
		|				И ВЫРАЗИТЬ(Основание КАК Документ.Сделка).ОтложенноеИсполнение = ИСТИНА
		|				И ВЫРАЗИТЬ(Основание КАК Документ.Сделка).Дата < &НачалоПериода) КАК ЗадолженностиПоЦеннымБумагамОстаткиИОбороты
		|ГДЕ
		|	ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.КоличествоОборот <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫРАЗИТЬ(ЗадолженностиПоЦеннымБумагамОстаткиИОбороты.Основание КАК Документ.Сделка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Основание КАК Документ.Сделка) КАК Сделка,
		|	СУММА(ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаКонечныйОстаток + ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаКупонаКонечныйОстаток) КАК ОстатокЗадолженностиПоДС
		|ПОМЕСТИТЬ _ОстаткиЗадолженностиПоДСПоИсполненнымСделкам
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.ОстаткиИОбороты(
		|			&ГраницаНачалоПериода,
		|			&ГраницаКонецПериода,
		|			Период,
		|			ДвиженияИГраницыПериода,
		|			ТИПЗНАЧЕНИЯ(Основание) = ТИП(Документ.Сделка)
		|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
		|				И Организация = &Организация
		|				И СчетДоверительногоУправления = &Клиент
		|				И ВЫРАЗИТЬ(Основание КАК Документ.Сделка).ОтложенноеИсполнение = ИСТИНА
		|				И ВЫРАЗИТЬ(Основание КАК Документ.Сделка).Дата < &НачалоПериода) КАК ЗадолженностиПоДенежнымСредствамОстаткиИОбороты
		|ГДЕ
		|	ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаОборот + ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.СуммаКупонаОборот <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОстаткиИОбороты.Основание КАК Документ.Сделка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(_ОстаткиЗадолженностиПоЦБПоИсполненнымСделкам.Сделка, _ОстаткиЗадолженностиПоДСПоИсполненнымСделкам.Сделка) КАК Сделка,
		|	СУММА(ЕСТЬNULL(_ОстаткиЗадолженностиПоЦБПоИсполненнымСделкам.ОстатокЗадолженностиПоЦБ, 0)) КАК ОстатокЗадолженностиПоЦБ,
		|	СУММА(ЕСТЬNULL(_ОстаткиЗадолженностиПоДСПоИсполненнымСделкам.ОстатокЗадолженностиПоДС, 0)) КАК ОстатокЗадолженностиПоДС
		|ПОМЕСТИТЬ _ЗадолженностиПоСделкам
		|ИЗ
		|	_ОстаткиЗадолженностиПоЦБПоИсполненнымСделкам КАК _ОстаткиЗадолженностиПоЦБПоИсполненнымСделкам
		|		ПОЛНОЕ СОЕДИНЕНИЕ _ОстаткиЗадолженностиПоДСПоИсполненнымСделкам КАК _ОстаткиЗадолженностиПоДСПоИсполненнымСделкам
		|		ПО _ОстаткиЗадолженностиПоЦБПоИсполненнымСделкам.Сделка = _ОстаткиЗадолженностиПоДСПоИсполненнымСделкам.Сделка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСТЬNULL(_ОстаткиЗадолженностиПоЦБПоИсполненнымСделкам.Сделка, _ОстаткиЗадолженностиПоДСПоИсполненнымСделкам.Сделка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ЗадолженностиПоСделкам.Сделка КАК Сделка
		|ПОМЕСТИТЬ _ИсполненныеСделки
		|ИЗ
		|	_ЗадолженностиПоСделкам КАК _ЗадолженностиПоСделкам
		|ГДЕ
		|	ВЫБОР
		|			КОГДА _ЗадолженностиПоСделкам.Сделка.МестоХранения В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок))
		|				ТОГДА _ЗадолженностиПоСделкам.ОстатокЗадолженностиПоЦБ = 0
		|						ИЛИ _ЗадолженностиПоСделкам.ОстатокЗадолженностиПоДС = 0
		|			ИНАЧЕ _ЗадолженностиПоСделкам.ОстатокЗадолженностиПоЦБ + _ЗадолженностиПоСделкам.ОстатокЗадолженностиПоДС = 0
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследнихКлиент.КраткоеНаименованиеПоУставу, _ДанныеДоговора.Клиент.Наименование) КАК Клиент,
		|	_ДанныеДоговора.НомерДоговора КАК НомерДоговора,
		|	_ДанныеДоговора.ДатаЗаключения КАК ДатаДоговора,
		|	&НачалоПериода КАК НачалоПериода,
		|	&КонецПериода КАК КонецПериода
		|ИЗ
		|	_ДанныеДоговора КАК _ДанныеДоговора
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&КонецПериода,
		|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И ЮрФизЛицо В
		|						(ВЫБРАТЬ
		|							_ДанныеДоговора.Клиент КАК Клиент
		|						ИЗ
		|							_ДанныеДоговора КАК _ДанныеДоговора)) КАК РеквизитыЮридическихЛицСрезПоследнихКлиент
		|		ПО _ДанныеДоговора.Клиент = РеквизитыЮридическихЛицСрезПоследнихКлиент.ЮрФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиДенежныхСредств.Период КАК Дата,
		|	ВЫБОР
		|		КОГДА _ОперацииДДС.Операция ЕСТЬ NULL
		|			ТОГДА ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств.Наименование
		|		ИНАЧЕ _ОперацииДДС.Операция
		|	КОНЕЦ КАК Операция,
		|	ОстаткиДенежныхСредств.Сумма КАК Сумма,
		|	ОстаткиДенежныхСредств.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КурсыВалютДляДвиженийДС КАК _КурсыВалютДляДвиженийДС
		|		ПО (НАЧАЛОПЕРИОДА(ОстаткиДенежныхСредств.Период, ДЕНЬ) = _КурсыВалютДляДвиженийДС.Период)
		|			И ОстаткиДенежныхСредств.Валюта = _КурсыВалютДляДвиженийДС.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрПлатежей КАК РеестрПлатежей
		|		ПО ОстаткиДенежныхСредств.Регистратор = РеестрПлатежей.Регистратор
		|			И ОстаткиДенежныхСредств.ВидДвиженияДенежныхСредств = РеестрПлатежей.ВидДвиженияДенежныхСредств
		|			И (ВЫБОР
		|				КОГДА ОстаткиДенежныхСредств.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|					ТОГДА РеестрПлатежей.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|				ИНАЧЕ РеестрПлатежей.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОперацииДДС КАК _ОперацииДДС
		|		ПО ОстаткиДенежныхСредств.ВидДвиженияДенежныхСредств = _ОперацииДДС.Вид
		|			И ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств = _ОперацииДДС.Вариант
		|ГДЕ
		|	ОстаткиДенежныхСредств.Организация = &Организация
		|	И ОстаткиДенежныхСредств.СчетДоверительногоУправления = &Клиент
		|	И ОстаткиДенежныхСредств.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОстаткиДенежныхСредств.РасчетныйСчет В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				_ДанныеБанковскихСчетов.РасчетныйСчет КАК РасчетныйСчет
		|			ИЗ
		|				_ДанныеБанковскихСчетов КАК _ДанныеБанковскихСчетов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДатыНачисленияЗадолженности.ДатаНачисления КАК ДатаНачисленияЗадолженности,
		|	ВЫБОР
		|		КОГДА _ОперацииДДС.Операция ЕСТЬ NULL
		|			ТОГДА ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств.Наименование
		|		ИНАЧЕ _ОперацииДДС.Операция
		|	КОНЕЦ КАК Операция,
		|	ОстаткиДенежныхСредств.Сумма КАК Сумма,
		|	ОстаткиДенежныхСредств.Период КАК Дата,
		|	ОстаткиДенежныхСредств.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КурсыВалютДляДвиженийДС КАК _КурсыВалютДляДвиженийДС
		|		ПО (НАЧАЛОПЕРИОДА(ОстаткиДенежныхСредств.Период, ДЕНЬ) = _КурсыВалютДляДвиженийДС.Период)
		|			И ОстаткиДенежныхСредств.Валюта = _КурсыВалютДляДвиженийДС.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрПлатежей КАК РеестрПлатежей
		|		ПО ОстаткиДенежныхСредств.Регистратор = РеестрПлатежей.Регистратор
		|			И ОстаткиДенежныхСредств.ВидДвиженияДенежныхСредств = РеестрПлатежей.ВидДвиженияДенежныхСредств
		|			И (ВЫБОР
		|				КОГДА ОстаткиДенежныхСредств.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|					ТОГДА РеестрПлатежей.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|				ИНАЧЕ РеестрПлатежей.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОперацииДДС КАК _ОперацииДДС
		|		ПО ОстаткиДенежныхСредств.ВидДвиженияДенежныхСредств = _ОперацииДДС.Вид
		|			И ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств = _ОперацииДДС.Вариант
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДатыНачисленияЗадолженности КАК _ДатыНачисленияЗадолженности
		|		ПО ОстаткиДенежныхСредств.Регистратор = _ДатыНачисленияЗадолженности.Регистратор
		|ГДЕ
		|	ОстаткиДенежныхСредств.Организация = &Организация
		|	И ОстаткиДенежныхСредств.СчетДоверительногоУправления = &Клиент
		|	И ОстаткиДенежныхСредств.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОстаткиДенежныхСредств.РасчетныйСчет В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				_ДанныеБанковскихСчетов.РасчетныйСчет КАК РасчетныйСчет
		|			ИЗ
		|				_ДанныеБанковскихСчетов КАК _ДанныеБанковскихСчетов)
		|	И ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств В(&ВидыЗадолженностиДляТаблицыДивидендов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеПоСделкам.Эмитент КАК Эмитент,
		|	_ДанныеПоСделкам.ТипЦБ КАК ТипАктива,
		|	_ДанныеПоСделкам.Дата КАК Дата,
		|	_ДанныеПоСделкам.Актив КАК Актив,
		|	_ДанныеПоСделкам.ISIN КАК ISIN,
		|	_ДанныеПоСделкам.Операция КАК Операция,
		|	_ДанныеПоСделкам.Количество КАК Количество,
		|	_ДанныеПоСделкам.Цена КАК Цена,
		|	_ДанныеПоСделкам.НКД КАК НКД,
		|	_ДанныеПоСделкам.Сумма КАК Сумма,
		|	_ДанныеПоСделкам.БиржевойСбор КАК КомиссияБиржи,
		|	_ДанныеПоСделкам.КомиссияБрокера КАК КомиссияБрокера,
		|	_ДанныеПоСделкам.Сумма + _ДанныеПоСделкам.НКД КАК СуммаСделки,
		|	_ДанныеПоСделкам.ДатаОплаты КАК ДатаОплаты,
		|	_ДанныеПоСделкам.ДатаПоставки КАК ДатаПоставки,
		|	_ДанныеПоСделкам.Курс КАК Курс,
		|	_ДанныеПоСделкам.Сделка КАК Сделка,
		|	_ДанныеПоСделкам.Контрагент КАК Контрагент
		|ИЗ
		|	_ДанныеПоСделкам КАК _ДанныеПоСделкам
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата
		|ИТОГИ ПО
		|	Эмитент,
		|	ТипАктива
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УсловияСделокСрезПоследних.Сделка.Дата КАК ДатаОперации,
		|	УсловияСделокСрезПоследних.ДатаОплаты КАК Оплата,
		|	УсловияСделокСрезПоследних.ДатаПоставки КАК РасчетыПоЦБ,
		|	УсловияСделокСрезПоследних.Сделка.ВидСделки КАК ОбозначениеОперации,
		|	УсловияСделокСрезПоследних.ЦеннаяБумага КАК НаименованиеАктива,
		|	УсловияСделокСрезПоследних.Сумма + УсловияСделокСрезПоследних.СуммаКупона КАК Сумма,
		|	УсловияСделокСрезПоследних.Сделка.ВалютаСделки КАК Валюта,
		|	УсловияСделокСрезПоследних.Сделка КАК Сделка
		|ИЗ
		|	РегистрСведений.УсловияСделок.СрезПоследних(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И Сделка В
		|					(ВЫБРАТЬ
		|						_ИсполненныеСделки.Сделка КАК Сделка
		|					ИЗ
		|						_ИсполненныеСделки КАК _ИсполненныеСделки)) КАК УсловияСделокСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу, ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.Банк.ЮрФизЛицо.Представление) КАК Наименование,
		|	РеквизитыЮридическихЛицСрезПоследних.СтранаРегистрации.Наименование КАК Страна,
		|	КонтактнаяИнформацияСрезПоследних.Представление КАК Адрес,
		|	ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет КАК РасчетныйСчет
		|ИЗ
		|	РегистрСведений.ИсполнителиПоДенежнымСредствамСобственные КАК ИсполнителиПоДенежнымСредствамСобственные
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&КонецПериода,
		|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.Банк.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация.СрезПоследних(
		|				&КонецПериода,
		|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮридическийАдрес)) КАК КонтактнаяИнформацияСрезПоследних
		|		ПО ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.Банк.ЮрФизЛицо = КонтактнаяИнформацияСрезПоследних.Объект
		|ГДЕ
		|	ИсполнителиПоДенежнымСредствамСобственные.Организация = &Организация
		|	И ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления = &Клиент
		|	И (ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия >= &НачалоПериода)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу, КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Брокер.ЮрФизЛицо.Представление) КАК Наименование,
		|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК НаименованиеПолное,
		|	РеквизитыЮридическихЛицСрезПоследних.ИНН КАК ИНН,
		|	РеквизитыЮридическихЛицСрезПоследних.ОГРН КАК ОГРН,
		|	КонтактнаяИнформацияСрезПоследних.Представление КАК Адрес,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания КАК ДоговорБрокерскогоОбслуживания
		|ИЗ
		|	РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &Клиент) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&КонецПериода,
		|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Брокер.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация.СрезПоследних(
		|				&КонецПериода,
		|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮридическийАдрес)) КАК КонтактнаяИнформацияСрезПоследних
		|		ПО КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Брокер.ЮрФизЛицо = КонтактнаяИнформацияСрезПоследних.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(&КонецПериода, ) КАК УсловияДоговоровОбщиеСрезПоследних
		|		ПО КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания = УсловияДоговоровОбщиеСрезПоследних.Договор
		|ГДЕ
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Организация = &Организация
		|	И КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления = &Клиент
		|	И (ЕСТЬNULL(УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения >= &НачалоПериода)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу, СчетаДоверительногоУправления.СпециализированныйДепозитарий.ЮрФизЛицо.Представление) КАК Наименование,
		|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК НаименованиеПолное,
		|	РеквизитыЮридическихЛицСрезПоследних.ИНН КАК ИНН,
		|	РеквизитыЮридическихЛицСрезПоследних.ОГРН КАК ОГРН,
		|	КонтактнаяИнформацияСрезПоследних.Представление КАК Адрес
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация.СрезПоследних(
		|				&КонецПериода,
		|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮридическийАдрес)) КАК КонтактнаяИнформацияСрезПоследних
		|		ПО СчетаДоверительногоУправления.СпециализированныйДепозитарий.ЮрФизЛицо = КонтактнаяИнформацияСрезПоследних.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&КонецПериода,
		|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО СчетаДоверительногоУправления.СпециализированныйДепозитарий.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|ГДЕ
		|	СчетаДоверительногоУправления.Ссылка = &Клиент
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
	#КонецОбласти
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеШапки				= РезультатЗапроса[РезультатЗапроса.Количество()-8].Выбрать();
	ОперацииСДС				= РезультатЗапроса[РезультатЗапроса.Количество()-7].Выбрать();
	ДивидендыКупоны			= РезультатЗапроса[РезультатЗапроса.Количество()-6].Выбрать();
	СделкиЭмитент			= РезультатЗапроса[РезультатЗапроса.Количество()-5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ИсполненныеСделки		= РезультатЗапроса[РезультатЗапроса.Количество()-4].Выбрать();
	СведенияОБанках			= РезультатЗапроса[РезультатЗапроса.Количество()-3].Выбрать();
	СведенияОБрокерах		= РезультатЗапроса[РезультатЗапроса.Количество()-2].Выбрать();
	СведенияОДепозитариях	= РезультатЗапроса[РезультатЗапроса.Количество()-1].Выбрать();
	
	// Вывод шакпи.
	Если ДанныеШапки.Следующий() Тогда
		
		Шапка.Параметры.Заполнить(ДанныеШапки);
		
		Шапка.Параметры.ДатаДоговора	= Формат(ДанныеШапки.ДатаДоговора,	"ДФ='dd.MM.yyyy ''г.'''");
		
		Если Год(ДанныеШапки.НачалоПериода) = Год(ДанныеШапки.КонецПериода)
			И Месяц(ДанныеШапки.НачалоПериода) = Месяц(ДанныеШапки.КонецПериода)
			И НачалоМесяца(ДанныеШапки.НачалоПериода) = ДанныеШапки.НачалоПериода
			И КонецМесяца(ДанныеШапки.КонецПериода) = ДанныеШапки.КонецПериода Тогда
			Шапка.Параметры.ПредставлениеПериода = Формат(ДанныеШапки.НачалоПериода, "ДФ='MMMM гггг'")
		Иначе
			Шапка.Параметры.ПредставлениеПериода = Формат(ДанныеШапки.НачалоПериода, "ДФ=dd.MM.yyyy") + " - " + Формат(ДанныеШапки.КонецПериода, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		
	КонецЕсли;
	
	Результат.Вывести(Шапка);
	
	// Операции с ДС.
	Пока ОперацииСДС.Следующий() Цикл
		СтрокаОперацииСДС.Параметры.Заполнить(ОперацииСДС);
		
		Результат.Вывести(СтрокаОперацииСДС);
	КонецЦикла;
	
	// Дивиденды, купоны, проценты.
	Результат.Вывести(ЗаголовокДвивидены);
	
	Пока ДивидендыКупоны.Следующий() Цикл
		СтрокаДивиденды.Параметры.Заполнить(ДивидендыКупоны);
		
		Результат.Вывести(СтрокаДивиденды);
	КонецЦикла;
	
	// Сделки.
	ВыведенЗаголовок = Ложь;
	
	Пока СделкиЭмитент.Следующий() Цикл
		
		Если НЕ ВыведенЗаголовок Тогда
			Результат.Вывести(ЗаголовокСделки);
			
			ВыведенЗаголовок = Истина;
		КонецЕсли;
		
		ЗаголовокЭмитент.Параметры.Заполнить(СделкиЭмитент);
		
		Результат.Вывести(ЗаголовокЭмитент);
		
		СделкиТипАктива = СделкиЭмитент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока СделкиТипАктива.Следующий() Цикл
			
			ЗаголовокТипАктива.Параметры.Заполнить(СделкиТипАктива);
			
			Результат.Вывести(ЗаголовокТипАктива);
			
			Сделки = СделкиТипАктива.Выбрать();
			
			Пока Сделки.Следующий() Цикл
				СтрокаСделки.Параметры.Заполнить(Сделки);
				
				СтрокаСделки.Параметры.Основание = "Отчет брокера от " + Формат(Сделки.Дата, "ДФ=dd.MM.yyyy");
				
				Результат.Вывести(СтрокаСделки);
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	//Операции, расчитанные в период отчета.
	Результат.Вывести(ЗаголовокОперацииСовершенныеРанее);
	
	Пока ИсполненныеСделки.Следующий() Цикл
		СтрокаОперацииСовершенныеРанее.Параметры.Заполнить(ИсполненныеСделки);
		
		Результат.Вывести(СтрокаОперацииСовершенныеРанее);
	КонецЦикла;
	
	//Сведения о банках.
	Результат.Вывести(ЗаголовокСведенияОКредитныхОрганизациях);
	
	Пока СведенияОБанках.Следующий() Цикл
		СтрокаСведенияОКредитныхОрганизациях.Параметры.Заполнить(СведенияОБанках);
		
		Результат.Вывести(СтрокаСведенияОКредитныхОрганизациях);
	КонецЦикла;
	
	//Сведения о брокерах.
	Результат.Вывести(ЗаголовокСведенияОБрокере);
	
	Пока СведенияОБрокерах.Следующий() Цикл
		СтрокаСведенияОБрокере.Параметры.Заполнить(СведенияОБрокерах);
		
		Результат.Вывести(СтрокаСведенияОБрокере);
	КонецЦикла;
	
	//Сведения о депозитариях.
	Результат.Вывести(ЗаголовокСведенияОДепозитариях);
	
	Пока СведенияОДепозитариях.Следующий() Цикл
		СтрокаСведенияОДепозитариях.Параметры.Заполнить(СведенияОДепозитариях);
		
		Результат.Вывести(СтрокаСведенияОДепозитариях);
	КонецЦикла;
	
	// Заполняем настройки печати	
	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(Результат, ЭтотОбъект.Метаданные().ПолноеИмя(), Истина, ОриентацияСтраницы.Ландшафт);
	
	// Фиксируем завершение операции
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
		
КонецПроцедуры

Функция ПолучитьОперацииДДС()
	
	ТипыВариантов = Новый Массив;
	
	ТипыВариантов.Добавить(Тип("СправочникСсылка.ВидыЗадолженности"));
	ТипыВариантов.Добавить(Тип("СправочникСсылка.ВидыОперацийПриВводеВыводеДенежныхСредств"));
	ТипыВариантов.Добавить(Тип("ПеречислениеСсылка.ВидыПереводовДенежныхСредств"));
	
	ОперацииДДС = Новый ТаблицаЗначений;
	
	ОперацииДДС.Колонки.Добавить("Вид",			Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДвиженийДенежныхСредств"));
	ОперацииДДС.Колонки.Добавить("Вариант",		Новый ОписаниеТипов(ТипыВариантов));
	ОперацииДДС.Колонки.Добавить("Операция",	Новый ОписаниеТипов("Строка"));
	
	Макет = ПолучитьМакет("ОперацииДДС");
	
	Индекс = 2;
	
	Пока Макет.Область(Индекс, 1).Текст <> "" Цикл
		
		НоваяСтрока = ОперацииДДС.Добавить();
		
		Попытка
			НоваяСтрока.Вид = Вычислить(Макет.Область(Индекс, 1).Текст);
		Исключение
			ОперацииДДС.Удалить(НоваяСтрока);
			Индекс = Индекс + 1;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось вычислить значение вида ДДС при сборке таблицы операций ДДС! Вычисляемое выражение '" + Макет.Область(Индекс, 1).Текст + "'.");
			Продолжить;
		КонецПопытки;
		
		Попытка
			НоваяСтрока.Вариант = Вычислить(Макет.Область(Индекс, 2).Текст);
		Исключение
			ОперацииДДС.Удалить(НоваяСтрока);
			Индекс = Индекс + 1;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось вычислить значение варианта ДДС при сборке таблицы операций ДДС! Вычисляемое выражение '" + Макет.Область(Индекс, 2).Текст + "'.");
			Продолжить;
		КонецПопытки;
		
		НоваяСтрока.Операция = Макет.Область(Индекс, 3).Текст;
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
	Возврат ОперацииДДС;
	
КонецФункции

#Область Автоматизация_формирования_отчета

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокПредоставления");
	
	Возврат Настройки;

КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	// Заполняем настройки отчета	

	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	ЭтотОбъект.Клиент = НастройкиОтчета.СчетДоверительногоУправления; 
	
	// Формируем отчет	
	
	СформироватьОтчет();
	
	НастройкиОтчета.Вставить("Результат", ЭтотОбъект.Результат);
	
КонецПроцедуры

#КонецОбласти
